{
  "backend/main.mo": "Motoko actor defining Movie type and implementing CRUD operations for movies and user lists, including search, add/remove from list, and sample data seeding functions.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including homepage hero section, movie rows, navigation bar, detail page, search functionality, and My List feature with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality in the Netflix-inspired movie recap application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining Netflix-inspired dark theme color palette using OKLCH color system for light and dark modes.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, movie detail, and my list pages, wrapped in dark theme provider with toast notifications.",
  "frontend/src/components/HeroSection.tsx": "Netflix-style hero banner component displaying featured movie with backdrop image, gradient overlays, title, metadata, and action buttons for reading recap.",
  "frontend/src/components/MovieCard.tsx": "Movie card component with poster image, hover effects revealing title and metadata, and add-to-list button with loading states.",
  "frontend/src/components/MovieRow.tsx": "Horizontal scrollable row of movie cards with category title and left/right arrow navigation buttons that appear on hover.",
  "frontend/src/components/Navbar.tsx": "Navigation bar component with logo, nav links, search button, user icon, and mobile menu using Sheet component. Applies scroll-based background styling.",
  "frontend/src/components/SearchModal.tsx": "Modal dialog for searching movies with real-time results display in a grid layout. Navigates to movie detail page on selection.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Includes AuthClient configuration and delegation handling.",
  "frontend/src/hooks/useMyList.ts": "Custom hook that combines list queries and mutations to provide utilities for checking if a movie is in the user's list and toggling list membership.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including movie search, fetching movie details, managing user's list, adding movies, and seeding data.",
  "frontend/src/index.css": "Tailwind CSS configuration with Netflix-inspired color palette using OKLCH color space, custom CSS variables for theming, and scrollbar hiding utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying navbar, hero section, and movie rows. Seeds sample movie data (The Dark Knight, Inception, Shawshank Redemption, etc.) on first load if database is empty.",
  "frontend/src/pages/MovieDetailPage.tsx": "Movie detail page component that displays a hero section with backdrop image, movie metadata (title, year, genre, duration), and the full recap script in a scrollable area. Includes navigation back to home and a button to add/remove the movie from the user's list.",
  "frontend/src/pages/MyListPage.tsx": "My List page component that displays a grid of saved movies with poster images, metadata overlays on hover, and remove buttons. Shows empty state when no movies are saved and handles navigation to movie detail pages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom Netflix-themed color palette (blacks, grays, red accent), extended shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a Netflix-like movie recap app with completed features including homepage hero section, horizontal scrollable movie rows, navigation bar, detail pages, search, My List functionality, and responsive dark theme design."
}