{
  "backend/main.mo": "Main actor defining Movie type and implementing CRUD operations for movies and user watchlists using Map and List data structures, with preupgrade hook seeding sample movies.",
  "backend/migration.mo": "Migration module that converts legacy userLists from Set-based storage to List-based storage for compatibility with the new actor structure.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to error handling, loading states, and debugging for the React frontend application.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality across components, pages, hooks, and configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color tokens using OKLCH color system for Netflix-inspired styling.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with three routes (home, movie detail, my list), wrapped in ErrorBoundary, ThemeProvider, and Suspense with loading fallback.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches rendering errors, logs them to console, and displays a user-friendly error UI with reload button.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying featured movie with backdrop image, title, metadata, gradient overlays, and action buttons for reading recap or viewing more info.",
  "frontend/src/components/HeroSkeleton.tsx": "Skeleton loading placeholder for the hero section with animated background and content placeholders matching the hero layout.",
  "frontend/src/components/MovieCard.tsx": "Movie card component with poster image, hover overlay showing title/metadata, and add-to-list button that navigates to detail page on click.",
  "frontend/src/components/MovieRow.tsx": "Displays a horizontal scrollable row of movie cards with a title and left/right navigation arrows that appear on hover.",
  "frontend/src/components/MovieRowSkeleton.tsx": "Loading skeleton component that displays placeholder cards while movie row data is being fetched.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with logo, navigation links (Home, My List), search button, user icon, and mobile menu; changes background on scroll.",
  "frontend/src/components/SearchModal.tsx": "Modal dialog for searching movies with a text input and grid display of results; navigates to movie detail page on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with Internet Identity authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useMyList.ts": "Custom hook that provides functions to check, add, remove, and toggle movies in the user's list using underlying query hooks.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching all movies, searching movies, getting individual movies, and managing user's movie list with mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with Netflix-inspired dark theme color palette using OKLCH color space and custom scrollbar hiding utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that displays a hero section and movie rows organized by genre. Seeds sample movie data on first load if the database is empty, using useGetAllMovies and useAddMovie hooks.",
  "frontend/src/pages/MovieDetailPage.tsx": "Movie detail page that displays full movie information including backdrop image, metadata (year, genre, duration), and the complete recap script. Includes 'Add to My List' functionality and back navigation.",
  "frontend/src/pages/MyListPage.tsx": "Displays user's saved movies in a grid layout with remove functionality. Shows empty state when list is empty and allows navigation to individual movie detail pages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom Netflix-themed color palette (blacks, grays, red), extended animations, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking implemented features, architectural notes, and known issues including blank screen on deployment and CSP errors on Internet Computer. Documents Netflix-like UI/UX requirements and existing feature implementations."
}